{
  "siteTitle": "Apartamento Rural Asturias",
  "defaultTheme": "Asturias Green & Rural",
  "colorThemes": [
    {
      "name": "Asturias Green & Rural",
      "primary": "#2E8B57",
      "secondary": "#6B8E23",
      "accent": "#D2B48C",
      "lightBg": "#F0F8F0",
      "whiteBg": "#F8F8F0",
      "darkText": "#2F4F4F",
      "lightText": "#ffffff",
      "borderColor": "#A2CD5A"
    },
    {
      "name": "Default",
      "primary": "#007bff",
      "secondary": "#6c757d",
      "accent": "#ffc107",
      "lightBg": "#f8f9fa",
      "whiteBg": "#ffffff",
      "darkText": "#343a40",
      "lightText": "#ffffff",
      "borderColor": "#dee2e6"
    },
    {
      "name": "Costero Sereno",
      "primary": "#005F73",
      "secondary": "#0A9396",
      "accent": "#94D2BD",
      "lightBg": "#EAEFF4",
      "whiteBg": "#F5F9FC",
      "darkText": "#001219",
      "lightText": "#ffffff",
      "borderColor": "#005F73"
    }
  ],
  "footerText": "© 2024 Apartamento Rural Asturias. Todos los derechos reservados.",
  "heroPage": {
    "title": "Bienvenido a Miguermo Asturias",
    "description": "La web de Miguermo para ayudarte a planificar unos días en nuestro apartamento rural en Asturias."
  },
  "contactPage": {
    "title": "Contacta con Nosotros",
    "description": "Estamos aquí para resolver tus dudas y ayudarte con tu reserva. No dudes en ponerte en contacto con nosotros.",
    "email": "info@apartamentoasturias.com",
    "phone": "+34 123 456 789",
    "address": "Calle Falsa 123, 33001 Oviedo, Asturias, España",
    "hours": "Lunes a Viernes: 9:00 - 18:00<br>Sábados y Domingos: Solo emergencias (consulta disponibilidad)"
  },
  "calendarPage": {
    "title": "Calendario y Reservas",
    "description": "Consulta nuestra disponibilidad en el calendario y haz tu reserva a través del formulario externo.",
    "googleCalendarEmbedUrl": "https://calendar.google.com/calendar/embed?src=miguermoasturias%40gmail.com&ctz=Europe%2FMadrid",
    "googleFormLink": "https://docs.google.com/forms/d/e/1FAIpQLSf8z98xg1iXgWU5eG9kAdIuBWK2IDVxMC9BTPjqofw9CZJ-AQ/viewform",
    "bookingSection": {
      "bookingTitle": "Envía tu Solicitud de Reserva",
      "bookingDescription": "Una vez que hayas verificado la disponibilidad, haz clic en el botón de abajo para acceder a nuestro formulario de reserva. Nos pondremos en contacto contigo lo antes posible para confirmar tu estancia."
    }
  },
  "informationPage": {
    "title": "¡Bienvenid@s a Nuestro Apartamento!",
    "description": "Hola a tod@s. Esta página es para facilitaros la vida cuando queráis venir a disfrutar unos días en nuestro apartamento. Aquí tenéis la información clave para que vuestra estancia sea lo más cómoda posible y podáis planificaros sin problemas. Si tenéis cualquier duda que no esté aquí, ¡no dudéis en consultarnos directamente!",
    "rules": [
      "**¡No fumar!** Es una regla estricta para mantener el apartamento fresco para todos.",
      "**Horario de descanso:** Por respeto a los vecinos, intentad mantener la calma entre las 22:00h y las 08:00h. Las paredes no son de papel, ¡jeje!",
      "**Orden a la salida:** No os agobiéis con la limpieza a fondo, pero por favor, dejad el apartamento recogido y con los enseres básicos en su sitio.",
      "**Cerrar todo:** Antes de salir, aseguraos de cerrar bien puertas y ventanas. ¡Más vale prevenir!",
      "**Basura:** Tenemos contenedores de reciclaje cerca, por favor, separad los residuos. ¡Ayudamos al planeta y mantenemos el apartamento limpio!",
      "**Mascotas:** Si pensáis traer a vuestras mascotas, por favor, avisadnos con antelación. Algunas excepciones se pueden considerar, ¡pero siempre consultando primero!"
    ],
    "services": [
      "**Wi-Fi super rápido:** ¡Para que no os perdáis nada ni se os corte el streaming! La clave la encontraréis en la nevera.",
      "**Ropa de cama y toallas:** No os preocupéis por eso, tendréis todo lo necesario y de sobra.",
      "**Kit de bienvenida:** Siempre dejamos un poquito de café, té y azúcar para el primer día. ¡Un pequeño detalle para empezar bien!",
      "**Asistencia:** Si tenéis alguna emergencia, nuestro teléfono está 24/7. Para el resto de dudas, intentad agruparlas para no 'colapsarnos', ¡pero preguntad sin miedo!",
      "**Info turística local:** En el salón encontraréis un pequeño dosier con recomendaciones de sitios para visitar, comer y actividades por la zona. ¡Asturias para comérsela!"
    ],
    "amenities": [
      "**Cocina equipada:** Tendréis de todo: vitrocerámica, horno, microondas, nevera grande, lavavajillas... ¡para que os sintáis como en casa y podáis cocinar lo que queráis!",
      "**Cafetera Nespresso:** Para los amantes del café, con algunas cápsulas de cortesía.",
      "**Smart TV:** Con acceso a Netflix, HBO, Disney+ (si tenéis cuenta, ¡la nuestra no está incluida!), YouTube...",
      "**Lavadora:** Para esas estancias más largas o si os mancháis en alguna ruta. El tendedero está en la terraza.",
      "**Secador y plancha:** Para que siempre estéis impecables.",
      "**Calefacción:** El apartamento es calentito en invierno, ¡no pasaréis frío!",
      "**Ducha de hidromasaje:** ¡Para relajaros después de un día de exploración!"
    ],
    "locationInfo": {
        "title": "¿Dónde estamos?",
        "description": "Nuestro apartamento está en una ubicación privilegiada en [Nombre de la Ciudad/Pueblo], ideal para explorar [Región/Área].",
        "address": "Calle Falsa 123, 33001 Oviedo, Asturias, España",
        "gettingThere": [
            "**En coche:** Fácil acceso desde la autovía A-X. Hay aparcamiento gratuito en los alrededores.",
            "**En transporte público:** La estación de autobuses está a 10 minutos a pie. Hay una parada de tren a 20 minutos."
        ],
        "nearbyAttractions": [
            "**Playa de San Claudio:** A solo 5 minutos en coche, perfecta para un día de sol y mar.",
            "**Centro de Oviedo:** A 15 minutos en coche, ideal para pasear, hacer compras y disfrutar de la gastronomía.",
            "**Ruta del Oso:** Un plan genial para hacer en bici o caminando, ¡preparad las piernas!",
            "**Museo de Bellas Artes de Asturias:** Imprescindible para los amantes del arte."
        ]
    }
  },
  "checklistPage": {
    "title": "Checklist para tu Estancia",
    "description": "Para que tu llegada y salida sean lo más cómodas posible, te dejamos unos formularios rápidos con los puntos clave. ¡Ayúdanos a mantener todo en orden!",
    "arrivalForm": {
      "description": "Antes de llegar, por favor, rellena este formulario para que tengamos todo listo. Nos ayuda a saber vuestra hora de llegada y si tenéis alguna necesidad especial.",
      "link": "https://forms.gle/TODO_TU_LINK_DE_LLEGADA"
    },
    "departureForm": {
      "description": "Al salir, os agradeceríamos que rellenarais este breve formulario. Nos ayuda a verificar que todo está correcto y a recopilar vuestras impresiones para seguir mejorando.",
      "link": "https://forms.gle/TODO_TU_LINK_DE_SALIDA"
    }
  }
}
