{
  "siteTitle": "Miguermo en San Claudio",
  "footerText": "© 2024 Apartamento Miguermo en San Claudio. Hecho con cariño para familia y amigos.",
  "defaultTheme": "Asturias Green & Rural",
  "colorThemes": [
    {
      "name": "Default",
      "primary": "#007bff",
      "secondary": "#6c757d",
      "accent": "#28a745",
      "lightBg": "#f8f9fa",
      "whiteBg": "#ffffff",
      "darkText": "#343a40",
      "lightText": "#ffffff",
      "borderColor": "#dee2e6"
    },
    {
      "name": "Asturias Green & Rural",
      "primary": "#28a745",
      "secondary": "#6c757d",
      "accent": "#007bff",
      "lightBg": "#f0f8f0",
      "whiteBg": "#ffffff",
      "darkText": "#212529",
      "lightText": "#ffffff",
      "borderColor": "#c3e6cb"
    }
  ],
  "heroPage": {
    "title": "¡Bienvenidos, Familia y Amigos!",
    "description": "Este es vuestro rincón en San Claudio. Consultad la disponibilidad y contadnos cuándo os apetece venir. ¡Aquí encontraréis todo lo necesario para planificar vuestra escapada!"
  },
  "calendarPage": {
    "title": "Calendario de Disponibilidad Familiar",
    "description": "Aquí podéis ver cuándo nuestro apartamento está libre para vuestras visitas. ¡Echad un vistazo y planifiquemos juntos vuestra estancia!",
    "googleCalendarEmbedUrl": "https://calendar.google.com/calendar/embed?height=600&wkst=2&ctz=Europe%2FMadrid&showPrint=0&showTabs=0&showCalendars=0&hl=es&src=bWlndWVybW9hc3R1cmlhc0BnbWFpbC5jb20&color=%2328a745",
    "bookingSection": {
      "bookingTitle": "¡Solicita tu Estancia!",
      "bookingDescription": "Si ya habéis encontrado unas fechas que os encajen, por favor, rellenad este pequeño formulario para que podamos coordinar vuestra visita. ¡Estamos deseando recibiros!",
      "googleFormLink": "https://forms.gle/NsCiy5J7yJP5M5dLA"
    }
  },
  "informationPage": {
    "title": "Información Práctica para Vuestra Visita",
    "description": "Aquí encontraréis todos los detalles importantes para que vuestra estancia sea lo más cómoda y agradable posible.",
    "rules": [
      "**Horario de Llegada:** Podéis llegar a partir de las 15:00h. ¡Avisadnos con antelación!",
      "**Horario de Salida:** Por favor, dejad el apartamento antes de las 11:00h para que podamos prepararlo para los siguientes.",
      "**No fumar:** Rogamos encarecidamente no fumar en el interior del apartamento. Hay zonas exteriores designadas.",
      "**Mascotas:** Sabemos que son parte de la familia, pero por favor, consultadnos antes si queréis traer a vuestras mascotas. Podríamos tener algunas condiciones especiales.",
      "**Ruido:** Seamos considerados con los vecinos, especialmente por la noche (de 22:00h a 08:00h).",
      "**Orden y Limpieza:** Os agradeceríamos que dejarais el apartamento en un estado razonable de orden al marcharos.",
      "**Basura:** Por favor, utilizad los contenedores de reciclaje y basura que encontraréis en las inmediaciones."
    ],
    "services": [
      "**WiFi de alta velocidad:** Conexión gratuita para todos.",
      "**Parking:** Hay aparcamiento público gratuito en los alrededores del edificio.",
      "**Ropa de cama y toallas:** Las encontraréis limpias y listas para vuestro uso.",
      "**Kit de bienvenida:** Pequeños detalles para que empecéis a sentiros como en casa (café, té, etc.)."
    ],
    "amenities": [
      "**Cocina totalmente equipada:** Con todo lo necesario para vuestras comidas (horno, microondas, vitrocerámica, nevera, lavavajillas, cafetera y menaje completo).",
      "**Salón-comedor:** Un espacio amplio y cómodo con TV de pantalla plana y sofá cama por si necesitáis espacio extra.",
      "**Dormitorio principal:** Con cama doble y un colchón muy cómodo para un buen descanso.",
      "**Baño:** Con ducha y secador de pelo.",
      "**Calefacción:** Para estar calentitos en los días más frescos."
    ],
    "locationInfo": {
      "title": "Dónde nos encontramos",
      "description": "Nuestro apartamento está en el bonito pueblo de San Claudio, a un paso de Oviedo y rodeado de la naturaleza asturiana.",
      "address": "San Claudio, 33191 Oviedo, Asturias, España",
      "googleMapsEmbedUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d23206.638779946043!2d-5.938295599084637!3d43.35966964379723!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0xd369292825b4e8d%3A0x7c40684f2a5e3f1c!2sSan%20Claudio%2C%2033191%20Oviedo%2C%20Asturias!5e0!3m2!1ses!2ses!4v1750173640643!5m2!1ses!2ses",
      "gettingThere": [
        "**En coche:** Acceso rápido desde la autovía A-63. Estamos a solo 10 minutos del centro de Oviedo.",
        "**Transporte público:** Hay una parada de tren de cercanías (línea Oviedo-San Claudio) a 5 minutos a pie. También servicio de autobús.",
        "**Desde el aeropuerto de Asturias (OVD):** Un trayecto de unos 30 minutos en coche o taxi."
      ],
      "nearbyAttractions": [
        "**Oviedo:** No os perdáis la Catedral, el Casco Antiguo y el Monte Naranco (a 15 min en coche).",
        "**Senda del Oso:** Una preciosa vía verde ideal para caminar o ir en bicicleta (acceso a 20 min en coche).",
        "**Playas:** Varias playas de la costa asturiana están a unos 30-40 minutos en coche (por ejemplo, Gijón o Salinas).",
        "**Prerrománico Asturiano:** Muy cerca de joyas como San Miguel de Lillo y Santa María del Naranco."
      ]
    }
  },
  "checklistPage": {
    "title": "Vuestro Checklist de Estancia",
    "description": "Para que vuestra visita sea lo más cómoda posible, aquí os dejamos unos checklists útiles para la llegada y la salida.",
    "arrivalForm": {
      "description": "Antes de llegar, por favor, rellenad este formulario para que tengamos todo listo para vuestra bienvenida.",
      "link": "https://forms.gle/NsCiy5J7yJP5M5dLA"
    },
    "departureForm": {
      "description": "Antes de marchar, por favor, ayudadnos completando este formulario para que sepamos que todo está en orden.",
      "link": "https://forms.gle/NsCiy5J7yJP5M5dLA"
    }
  }
}
